var type = {
  0: "1925",        //神庙
  1: "1938",        //stables马群
  2: "1921",        //town 城镇
  3: "1923",        //tower 瞭望塔
  18: "1937",       //大精灵泉水
  4: "1924",        //遗忘神殿
  5: "1916",        //呀哈哈
  7: "1934",        //回忆
  8: "1933",        //精英怪
  11: "1935",       //任务点
  6: "1932",        //守护者
  9: "1936",        //隐藏炸弹墙
  10: "1901",       //unknown
  12: "1931",       //camp 营火
  13: "1927",       //大桥
  14: "1905",       //植物
  15: "1910",       //unknown
  16: "1903",       //武器
  17: "1920",       //unknown
  19: "1930",       //unknown
  20: "1926",       //unknown
  21: "1915",       //unknown
  22: "1904",       //unknown
  23: "1906",       //unknown
  24: "1914",       //unknown
  25: "1911",       //unknown
  26: "1913"        //unknown
};
